{"country": "US", "category": {"name": "tech", "shortname": "tech", "id": 34}, "link": "http://www.meetup.com/PyLadies-Boston/", "id": 8401402, "lon": -71.05999755859375, "rating": 4.8, "lat": 42.36000061035156, "name": "PyLadies Boston", "visibility": "public_limited", "urlname": "PyLadies-Boston", "topics": [{"name": "Open Source", "id": 563, "urlkey": "opensource"}, {"name": "Python", "id": 1064, "urlkey": "python"}, {"name": "Software Development", "id": 3833, "urlkey": "softwaredev"}, {"name": "JavaScript", "id": 7029, "urlkey": "javascript"}, {"name": "Django", "id": 10553, "urlkey": "django"}, {"name": "Web Development", "id": 15582, "urlkey": "web-development"}, {"name": "Women's Empowerment", "id": 17933, "urlkey": "womens-empowerment"}, {"name": "Women's Business Networking", "id": 21283, "urlkey": "womens-business-networking"}, {"name": "Computer programming", "id": 48471, "urlkey": "computer-programming"}, {"name": "PyLadies", "id": 357041, "urlkey": "pyladies"}], "group_photo": {"photo_id": 246984502, "highres_link": "http://photos3.meetupstatic.com/photos/event/5/f/b/6/highres_246984502.jpeg", "photo_link": "http://photos3.meetupstatic.com/photos/event/5/f/b/6/600_246984502.jpeg", "thumb_link": "http://photos3.meetupstatic.com/photos/event/5/f/b/6/thumb_246984502.jpeg"}, "created": 1368029257000, "city": "Boston", "description": "<p>PyLadies Boston is for women and genderqueer individuals who are either Python programmers or aspiring Python programmers in the Boston area. Or even if you have no clue what Python is, but you're interested in learning to program. It's a great language to learn if you have no prior programming experience.</p>\n<p>Our goal is to get a larger number of women coding and involved in the open source community. Developers and aspiring developers only, please. We encourage all women to come out to our meetups. If anything is said during a meetup or in any PyLadies Boston forum, please contact the organizers. We want this to be a welcoming environment for all attendees and ask that everyone be treated respectfully. We follow the <a href=\"http://www.pyladies.com/CodeOfConduct/\">PyLadies Code of Conduct</a>.</p>\n<p>Join us on IRC! #pyladies-boston</p>\n<p><b>Pyladies Boston is for women and genderqueer individuals only. Men who join will be removed from the group.</b> Nothing personal. If you're interested in learning more about why we are women-only, read the articles in the \"Why Women Only?\" section on our <a href=\"http://boston.pyladies.com/resources/\">resources page</a>.</p>\n<p><b>Please note:</b> We highly discourage solicitation from recruiters unless explicitly invited or are sponsoring an event.  We are here to learn, to hack, and support women in the Python developers' community. Job postings are welcome on our forum.</p>\n<p>What to expect at our meetups:</p>\n<p><b>Presentation nights (Monthly meetings)</b>: These will be presentations put on by group members and other women (and the rare man) who are in Boston's programming community. We welcome talks about any relevant subject... it does not have to be strictly Python! We will not generally be installing things. However, feel free to email the organizers (boston[at]pyladies[dot]com) anytime if you are having trouble getting setup for a meeting. We also get there about 30 minutes early as well and are happy to help before (or after!) the meetup. The expected level of knowledge is just basic Python. Questions are always welcome, but if it's really basic, we will ask you if we can answer it later. If you can, also come grab a drink with us after the meetup!</p>\n<p><b>Beginner meetups</b>: Bring on your install problems! This is 100% about making sure beginners are up and running. Our beginner meetups are weekly (alternating Saturday and Sunday) and are project based. Don't have a project? No problem! You can still come and we'll help you get started.</p>\n<p><b>Hack Days</b>: We like building things together! Open to suggestions as to what we should build. We have coded our website during a hack day and have plans to build Django apps in other hack days. In general, we'll spend at least two hours trouble shooting installs, then the next four actually building something cool! Also a good place to have install problems.</p>\n<p> </p>", "organizer": {"name": "Jennifer Konikowski", "photo": {"photo_id": 251969115, "highres_link": "http://photos3.meetupstatic.com/photos/member/7/1/b/b/highres_251969115.jpeg", "photo_link": "http://photos3.meetupstatic.com/photos/member/7/1/b/b/member_251969115.jpeg", "thumb_link": "http://photos3.meetupstatic.com/photos/member/7/1/b/b/thumb_251969115.jpeg"}, "member_id": 26418712}, "timezone": "US/Eastern", "who": "Pythonistas", "members": 918, "state": "MA", "utc_offset": -14400000, "join_mode": "open"}